src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗакупочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция гсч_число(Разбег)
	гсч = Новый ГенераторСлучайныхЧисел();
    СлучайноеЧисло = гсч.СлучайноеЧисло(0, Разбег);   
	Возврат СлучайноеЧисло;
КонецФункции


&НаСервере
Функция ЗаполнитьВидНоменклатуры(Цех)
	
	Номенклатура = Справочники.Номенклатура;
	Отбор = Новый Структура("ВидНоменклатуры");
    Пусто = Перечисления.ВидНоменклатуры.ПустаяСсылка();
    Отбор.ВидНоменклатуры = Пусто;
	
    Выборка = Номенклатура.Выбрать(  , ,Отбор,"Наименование Убыв" );
    Пока Выборка.Следующий() Цикл
         Объект = Выборка.ПолучитьОбъект();
		 
		 Если СокрЛП(Цех.Наименование) = "Цех №1"
         Тогда
		      Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Товар;
		  Иначе
			  Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуги;
		 КонецЕсли;
         Попытка
               Объект.Записать();
         Исключение
               Сообщить("Не удалось записать объект ");
         КонецПопытки;
КонецЦикла;

	Возврат Объект; 

КонецФункции

&НаСервере
Функция ДобавитьНоменклатуру(Код)
	
	 ГруппаНомен = Справочники.Номенклатура.НайтиПоКоду(Код);
	 НовыйЭлементНоменклатуры = Справочники.Номенклатура.СоздатьЭлемент();
	 НовыйЭлементНоменклатуры.Родитель = ГруппаНомен.Ссылка;
	 
	 Если гсч_число(50)%2 = 0  Тогда
		  Склад = Справочники.Склады.НайтиПоНаименованию("Цех №1");
		  
		  //Хотел сделать вот так не получилось пришлось делать  ЗаполнитьВидНоменклатуры(Склад);
		  //Ошибку не выдало но поле не заполнилось хотя в дебагере значение есть
		  //ВидНоменклатуры = Перечисления.ВидНоменклатуры.Товар;

	 Иначе
		  Склад = Справочники.Склады.НайтиПоНаименованию("Цех №3");
		  
		  //Хотел сделать вот так не получилось пришлось делать  ЗаполнитьВидНоменклатуры(Склад);

		  //ВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуги ;

		  
     КонецЕсли;
	 
	 НовыйЭлементНоменклатуры.Склад = Склад;
	 НовыйЭлементНоменклатуры.Наименование = "Товар №"+Строка(гсч_число(30000));
	 
	 НовыйЭлементНоменклатуры.ЦенаЗакупочная  = гсч_число(300)/25;
	 НовыйЭлементНоменклатуры.ЦенаПоступления = гсч_число(400)/25;
	 
	 НовыйЭлементНоменклатуры.Записать();
	 
	 
	 ЗаполнитьВидНоменклатуры(Склад);

	 возврат код; 
	 	 
	 
КонецФункции
&НаСервере
Процедура ЗаполнениеСправочникаНаСервере()
	//Выбрать все групппы и добавить в каждую по 5 элементов с помощь генератора случайных чисел
	
	ЗапросГрупп = Новый Запрос;
	ЗапросГрупп.Текст = "ВЫБРАТЬ
	                    |	Номенклатура.Код,
	                    |	Номенклатура.Наименование КАК Наименование
	                    |ИЗ
	                    |	Справочник.Номенклатура КАК Номенклатура
	                    |ГДЕ
	                    |	Номенклатура.ЭтоГруппа = ИСТИНА
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Наименование
	                    |ИТОГИ ПО
	                    |	Номенклатура.Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	ГруппыНоменклатуры  = ЗапросГрупп.Выполнить().Выгрузить();
	Для Каждого Строка Из  ГруппыНоменклатуры Цикл
		ДобавитьНоменклатуру(Строка.Код);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеСправочника(Команда)
	Сколько = 50;
	Для Счетчик = 0 По Сколько Цикл
		ЗаполнениеСправочникаНаСервере();
    КонецЦикла;	
	
КонецПроцедуры
